<template>
  <div>
    <main>
      <img :src="result[mbti].img" :alt="result[mbti].title">
      <div class="contain">
        <h1>{{result[mbti].title}}</h1>
        <!-- v-html 은 보안상의 문제, XSS 와 같은 문제가 있을 수 있다. 
          그러므로 반드시 사용자가 컨트롤하거나 악용할 수 있는 문제에는 사용해선 안 된다.
          오직 개발자가 의도한 값만 표출해줄 때 사용해주면 된다. -->
        <p v-html="result[mbti].description"></p>
      </div>
        <Button text="다시 테스트하기!" :clickEvent="resetPage"/>
      
    </main>
  </div>
</template>

<script>
export default {
  data() {
    return {
      mbti: null,
      result: {
        istj: {
          img: "/istj.jpeg",
          title: "미네르바 맥고나걸",
          description: `<b>"왜 너희 세 명이 가는 곳마다 사건이 터지는 거지?"</b>
          <br/>
          <br /> - 엄근진의 대명사. 
          <br /> - 모든 학생을 공정하게 대우하며 뛰어난 실력으로 20대의 나이에 교수 자리에 오른 가장 모범적인 인물이다. 
          <br /> - 주어진 업무나 책임을 끝까지 완수하고 충성심이 높아 덤블도어가 가장 신임하는 교수기도 하다. 
          <br /> - 논리적이고 합리적인 것을 중시하며 현실적이고, 겉보기에 차갑다.
          <br /> - 갑작스러운 변화를 싫어해서 해리포터 3인방을 매우 골칫 덩어리로 생각하지만, 한편으로는 그들의 든든한 지원군이 되며 그들이 원하는 일을 할 수 있도록
          지원을 아끼지 않는다.
          <br /> - 가끔씩은 마음에 안드는 엄브리지를 해리 일당이 골탕 먹이자 통쾌해 하며 "과자 먹으렴"이라는 대사를 날리는 등 본인만의 위트를 지녔다.
          
          <br/><br/>
          <br /> - 그러나 가끔식 지나치게 상대를 통제하려는 경향이 있다. 
          <br /> - 이런 경향은 보통 스스로가 대단하다는 자의식 과잉의 결과물이다. 
          <br /> - 스스로 잘났단 걸 아는 경우가 대부분이다. 실제로 그렇게 잘나기도 해서 가끔 재수없다.
          <br /> - 다른 교수들과 함께 일하지 않고 혼자서 일하려는 경우가 많다. 
          <br /> - 농담을 하지만 진지하게 농담을 하는 편이라 과자를 먹으라는 위트도 진짜 과자 먹으라는 것처럼 들린다.
          
          
          <br/><br/> <br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/>
          &nbsp;&nbsp; <b style="font-size: 20px">덤블도어</b>: "맥고나걸 교수님과 같은 분들 덕분에 호그와트가 유지 됩니다."
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">론</b>: "그렇게 살면 숨 막혀요!"`
        },
        isfj: {
          img: "/isfj.jpeg",
          title: "네빌 롱보텀",
          description: `<b>"지옥이 얼어붙을 수는 있어도, 내가 너의 편에 붙는 일은 없어!"</b>
          <br/>
          <br /> - 초기에는 어리버리했으나 마지막에 가서 포텐 터진 캐릭터. 
          <br /> - 어렸을 때는 슬리데린 학생들로부터 괴롭힘을 당했으나 이후에는 가장 먼저 용기있게 그들을 대항한다.
          <br /> - 조용하고 차분하며 디테일을 꼼꼼하게 챙긴다. 
          <br /> - 기억력도 좋아 약초학에서만큼은 헤르미온느를 능가한다. 
          <br /> - 공감 능력이 뛰어나고, 상대방의 이야기를 잘 들어주는 전형적인 착한 친구다.
          <br /> - 안은 매우 단단해서 외유내강의 표본이다. 
          <br /> - 의리가 있고 의외인 곳에서 용기가 있어 해리를 찾는 죽음을 먹는 자들을 향해 "야, 찌질이들아. 걔는 여기 없어!"라며 소리친다.
          <br /> - 볼드모트를 앞에 두고도 해리와의 의리를 지키며 볼드모트의 호크룩스를 깨는 등, 평소에는 조용하지만 해야할 때 가장 용기 있게 나서는 인물이다.      
          
          <br/><br/> 
          <br /> - 그러나 개인주의적 성향이 있어 개인 시간을 방해 받는 것을 매우 싫어한다. 
          <br /> - 집에서 쉬는 것을 좋아하고, 개인적인 시간 갖는 것을 중요하게 생각한다.
          <br /> - 즉흥적으로 하는 것을 싫어하고, 무계획으로 사는 론을 보면서 답답해 하기도 한다. 
          <br /> - 남들에게 싫은 소리를 잘 하지 못해서 혼자 상처 받고 혼자서 곱씹다가 인연이 틀어지는 경우가 종종 있다 
          <br /> - 더 큰 문제는 그렇게 혼자 자기 맘에 안 들면 완전히 배척하는 경향이 있다. 
          <br /> - 완벽주의적인 성향이 있어서 일을 하다 완벽하지 못할 것 같으면 대충 해버리거나 아예 시작을 안 하는 경우가 있다.
          
          
          <br/><br/><br/> 
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">해리 포터</b>: "조용히 해줄 건 다 해주는 친구"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">론</b>: "그리핀도르의 몇 없는 아싸"`
        },
        esfj: {
          img: "/esfj.png",
          title: "세드릭 디고리",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        estj: {
          img: "/estj.jpeg",
          title: "헤르미온느 진 그레인저",
          description: `<b>"입 닥쳐 해리. 내가 여기 주인공이야"</b>
          <br/>
          <br /> - 호그와트의 대표 똑똑이. 
          <br /> - 해리 삼총사 중에서 브레인을 담당한다.
          <br /> - 단계적으로 계획을 잘 세우고 체계적이다.
          <br /> - 완벽주의고 책임감이 있어서 한 번 한 일은 완벽히 해낸다.
          <br /> - 순수 머글의 태생이었으나 순수 혈통인 슬리데린 애들보다 더 뛰어나며 자수성가 스타일이다.
          <br /> - 싸움을 싫어하지만 싸워서 지는 건 더 싫어 한다.
          <br /> - 호불호가 확실해서 슬리데린 애들을 싫어 한다.
          <br /> - 분명한 규칙을 따르고 그에 따라 행동한다. 
          <br /> - 따라서 무질서를 싫어한다.(론은 왜 좋아하게 된 거야?)     


          <br/><br/> 
          <br /> - 너무 솔직한 나머지 남들로부터 4가지 없다는 말을 듣기도 한다.
          <br /> - 자기 잘난 걸 알아서 잘난 체를 하는데 좀 과할 수 있다.
          <br /> - 문제는 진짜 잘났기 때문에 자신이 무엇을 잘못했는지 잘 모르는 경우가 종종 있다.
          <br /> - 너무 모범적인 나머지 융통성 없다는 말을 해리와 론으로부터 듣곤 한다.
          <br /> - 여유를 즐기지 못한다.
          <br /> - 감정 표현이 어려워서 진짜 친한 친구인 해리와 론을 제외하면 그녀의 감정을 알아 차려주는 사람이 별로 없다
          <br /> - 리더의 기질을 타고 났지만, 공감 능력이 떨어져서 아랫사람들과 종종 다투곤 한다.


          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">론</b>: "헤르미온느는 정말 완벽한 아내에요"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">론</b>: "그래서 문제에요"`
        },
        istp: {
          img: "/istp.jpeg",
          title: "빅토르 크룸",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        isfp: {
          img: "/isfp.jpeg",
          title: "해리 제임스 포터",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        estp: {
          img: "/estp.jpeg",
          title: "시리우스 블랙",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        esfp: {
          img: "/esfp.jpeg",
          title: "로널드 빌리우스 위즐리",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        intj: {
          img: "/intj.jpeg",
          title: "세베루스 스네이프",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        intp: {
          img: "/intp.jpeg",
          title: "아서 위즐리",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        entp: {
          img: "/entp.jpeg",
          title: "프레드 위즐리",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        entj: {
          img: "/entj.jpeg",
          title: "볼드모트",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        infp: {
          img: "/infp.jpeg",
          title: "루나 러브굿 ",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        infj: {
          img: "/infj.jpeg",
          title: "알버스 퍼시벌 울프릭 브라이언 덤블도어",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        enfp: {
          img: "/enfp.jpeg",
          title: "콜린 크리비",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },
        enfj: {
          img: "/enfj.png",
          title: "릴리 에번스 포터",
          description: `<b>"호그와트의 진정한 챔피언, 세드릭을 엄호해!"</b>
          <br/>
          <br /> - 호그와트의 챔피언이자 인기 스타. 
          <br /> - 책임감이 있고, 정직하며 한결 같아 많은 사람으로부터 인정을 받는다. 
          <br /> - 챔피언을 두고 경쟁한 해리에게 자길 구해줬다는 이유로 챔피언 자리를 스스로 내주려고 할 만큼 상황을 잘 받아들이고 의리가 있다. 
          <br /> - 리더의 자질을 타고 났고 옳고 그름을 잘 구별한다. 
          <br /> - 준비성이 철저하고 참을성이 많으며 타인을 잘 돕는다. 
          <br /> - 덤블도어는 그를 "언제나 모범적이고 신의있고 성실한 학생" 이라고 말한다.
          <br /> - 상대를 향한 배려심이 있고 조화와 균형을 중요시한다


          <br/><br/> 
          <br /> - 가끔씩 동의하진 않지만 겉으론 "맞아, 맞아"라며 동의해준다.
          <br /> - 더 나은 목표를 위해 비판을 수용하지만 필요 이상으로 비판을 곱씹을 때가 있다
          <br /> - 생각이 많아서 걱정이나 불안감이 있다.
          <br /> - 남의 말을 들어주는 것은 좋아하지만 싫은 소리나 조언을 잘 하지 못한다.
          <br /> - 남들을 잘 챙겨주는 것은 맞지만 자신의 이득도 뒤에서 잘 챙긴다.
          <br /> - 오해 받는 것을 매우 매우 싫어한다. 
          
          
          <br/><br/><br/>
          &nbsp;&nbsp;
          <b style="font-size: 20px"> 각 인물의 한 마디 </b>

          <br/><br/> 
          &nbsp;&nbsp; <b style="font-size: 20px">미네르바 맥고나걸</b>: "아주 모범적인 학생"
          <br/>
          &nbsp;&nbsp; <b style="font-size: 20px">네빌</b>: "사람 때문에 머리 빠질 친구"`
        },

      }
    }
  },
  created() {
    this.mbti = this.$route.params.mbti;

    if (this.result[this.$route.params.mbti] === undefined) {
      this.$router.push({name: "index"})
    }
  },
  methods: {
    resetPage() {
      this.$store.dispatch('clickResetButton')
      this.$router.push({name: "index"})
    }
  }
}
</script>

<style>

  h1 {
    font-size: 2em;
    text-shadow: 0 0 50px rgb(40, 40, 187), 0 0 3px #fff;
  }

  p {
    font-size: 18px;
    color: #fff;
    line-height: 1.5;
  }
  
  main .contain p > b {
    font-size: 25px;
  }
</style>